jonacappelle/nRF52-DCU/BLE_Services/ble_imu_service_c.c
    }
    else if(p_evt->evt_type != BLE_DB_DISCOVERY_COMPLETE)
    {
        NRF_LOG_DEBUG("Ble service discovery not complete");

        ble_imu_service_c_evt_t evt;
        evt.evt_type    = 0;
        p_ble_imu_service_c->evt_handler(p_ble_imu_service_c, &evt);
    }
}


uint32_t ble_imu_service_c_init(ble_imu_service_c_t * p_ble_imu_service_c, ble_imu_service_c_init_t * p_ble_imu_service_c_init)
{
    uint32_t      err_code;
    ble_uuid_t    imu_service_uuid;
    ble_uuid128_t imu_service_base_uuid = {THINGY_UUID_BASE};

    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c_init);
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c_init->evt_handler);

    p_ble_imu_service_c->peer_imu_service_db.config_cccd_handle      = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.config_handle           = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.euler_cccd_handle      = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.euler_handle           = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.heading_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.heading_handle         = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.adc_cccd_handle     = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.adc_handle          = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.pedometer_cccd_handle  = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.pedometer_handle       = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.quat_cccd_handle       = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.quat_handle            = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.raw_cccd_handle        = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.raw_handle             = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.rot_cccd_handle        = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.rot_handle             = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.tap_cccd_handle        = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.tap_handle             = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.gravity_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    p_ble_imu_service_c->peer_imu_service_db.gravity_handle         = BLE_GATT_HANDLE_INVALID;

    p_ble_imu_service_c->conn_handle                    = BLE_CONN_HANDLE_INVALID;
    p_ble_imu_service_c->evt_handler                    = p_ble_imu_service_c_init->evt_handler;

    err_code = sd_ble_uuid_vs_add(&imu_service_base_uuid, &p_ble_imu_service_c->uuid_type);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }
    VERIFY_SUCCESS(err_code);

    imu_service_uuid.type = p_ble_imu_service_c->uuid_type;
    imu_service_uuid.uuid = IMU_SERVICE_UUID_SERVICE;
    return ble_db_discovery_evt_register(&imu_service_uuid);
}

void ble_imu_service_c_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{

    // NRF_LOG_DEBUG("ble_imu_service_c_on_ble_evt");

    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_imu_service_c_t * p_ble_imu_service_c = (ble_imu_service_c_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GATTC_EVT_HVX:
            on_hvx(p_ble_imu_service_c, p_ble_evt);
            break;

        case BLE_GATTC_EVT_WRITE_RSP:
            on_write_rsp(p_ble_imu_service_c, p_ble_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_disconnected(p_ble_imu_service_c, p_ble_evt);
            break;

        default:
            break;
    }
}


/**@brief Function for configuring the CCCD.
 *
 * @param[in] conn_handle The connection handle on which to configure the CCCD.
 * @param[in] handle_cccd The handle of the CCCD to be configured.
 * @param[in] enable      Whether to enable or disable the CCCD.
 *
 * @return NRF_SUCCESS if the CCCD configure was successfully sent to the peer.
 */
static uint32_t cccd_configure_tes(uint16_t conn_handle, uint16_t handle_cccd, bool enable)
{
    NRF_LOG_DEBUG("Configuring CCCD. CCCD Handle = %d, Connection Handle = %d",
        handle_cccd,conn_handle);

    tx_message_t * p_msg;
    uint16_t       cccd_val = enable ? BLE_GATT_HVX_NOTIFICATION : 0;
    
    p_msg              = &m_tx_buffer[m_tx_insert_index++];
    m_tx_insert_index &= TX_BUFFER_MASK;

    p_msg->req.write_req.gattc_params.handle   = handle_cccd;
    p_msg->req.write_req.gattc_params.len      = WRITE_MESSAGE_LENGTH;
    p_msg->req.write_req.gattc_params.p_value  = p_msg->req.write_req.gattc_value;
    p_msg->req.write_req.gattc_params.offset   = 0;
    p_msg->req.write_req.gattc_params.write_op = BLE_GATT_OP_WRITE_REQ;
    p_msg->req.write_req.gattc_value[0]        = LSB_16(cccd_val);
    p_msg->req.write_req.gattc_value[1]        = MSB_16(cccd_val);
    p_msg->conn_handle                         = conn_handle;
    p_msg->type                                = WRITE_REQ;

    tx_buffer_process();
    return NRF_SUCCESS;
}


uint32_t ble_imu_service_c_quaternion_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.quat_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_adc_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

