jonacappelle/nRF52-DCU/BLE_Services/ble_imu_service_c.c
    return cccd_configure_tes(p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.adc_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_euler_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.euler_cccd_handle,
                          true);
}

uint32_t ble_imu_service_c_raw_notif_enable(ble_imu_service_c_t * p_ble_imu_service_c)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    if (p_ble_imu_service_c->conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    return cccd_configure_tes(p_ble_imu_service_c->conn_handle,
                          p_ble_imu_service_c->peer_imu_service_db.raw_cccd_handle,
                          true);
}

uint32_t ble_imu_service_config_set(ble_imu_service_c_t * p_imu_service, ble_imu_service_config_t * p_data)
{
    uint16_t               length = sizeof(ble_imu_service_config_t);

    VERIFY_PARAM_NOT_NULL(p_imu_service);

    if ((p_imu_service->conn_handle == BLE_CONN_HANDLE_INVALID))// || (!p_imu_service->is_tap_notif_enabled))
    {
        return NRF_ERROR_INVALID_STATE;
    }

    if (length > BLE_IMU_SERVICE_MAX_DATA_LEN)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    ble_gattc_write_params_t write_params;

    memset(&write_params, 0, sizeof(write_params));

    write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    write_params.handle = p_imu_service->peer_imu_service_db.config_handle;
    write_params.len = length;
    write_params.p_value = (uint8_t *)p_data;
    write_params.flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE;


    return sd_ble_gattc_write(p_imu_service->conn_handle, &write_params);
}


uint32_t ble_imu_service_c_handles_assign(ble_imu_service_c_t    * p_ble_imu_service_c,
                                  uint16_t         conn_handle,
                                  const imu_service_db_t * p_peer_handles)
{
    VERIFY_PARAM_NOT_NULL(p_ble_imu_service_c);

    p_ble_imu_service_c->conn_handle = conn_handle;
    if (p_peer_handles != NULL)
    {
        p_ble_imu_service_c->peer_imu_service_db = *p_peer_handles;
    }
    return NRF_SUCCESS;
}

// #endif // NRF_MODULE_ENABLED(BLE_IMU_SERVICE_C)
